Revit 2027 API
Application.NewDoubleArray Method
Creates a new instance of a double array.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DoubleArray NewDoubleArray()
Public Function NewDoubleArray As DoubleArray
public:
DoubleArray^ NewDoubleArray()
member NewDoubleArray : unit -> DoubleArray
Return Value
DoubleArray
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace